ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0c1105_c1106/LFSS_1.0.xml
    <register id="LFSS_SPMWPROT3" width="32" offset="0x150C" description="Scratch Pad Memory Write Protect Register 3">
        <bitfield id="WP_15_3" description="write protect SPMEM15 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_15_2" description="write protect SPMEM15 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_15_1" description="write protect SPMEM15 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_15_0" description="write protect SPMEM15 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_14_3" description="write protect SPMEM14 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_14_2" description="write protect SPMEM14- DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_14_1" description="write protect SPMEM14 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_14_0" description="write protect SPMEM14 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_13_3" description="write protect SPMEM13 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_13_2" description="write protect SPMEM13 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_13_1" description="write protect SPMEM13 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_13_0" description="write protect SPMEM13 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_12_3" description="write protect SPMEM12 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_12_2" description="write protect SPMEM12 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_12_1" description="write protect SPMEM12 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_12_0" description="write protect SPMEM12 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
    </register>
    <register id="LFSS_SPMWPROT4" width="32" offset="0x1510" description="Scratch Pad Memory Write Protect Register 4">
        <bitfield id="WP_19_3" description="write protect SPMEM19 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_19_2" description="write protect SPMEM19 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_19_1" description="write protect SPMEM19 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_19_0" description="write protect SPMEM19 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_18_3" description="write protect SPMEM18 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_18_2" description="write protect SPMEM18- DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_18_1" description="write protect SPMEM18 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_18_0" description="write protect SPMEM18 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_17_3" description="write protect SPMEM17 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_17_2" description="write protect SPMEM17 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_17_1" description="write protect SPMEM17 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_17_0" description="write protect SPMEM17 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_16_3" description="write protect SPMEM16 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_16_2" description="write protect SPMEM16 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_16_1" description="write protect SPMEM16 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_16_0" description="write protect SPMEM16 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
    </register>
    <register id="LFSS_SPMWPROT5" width="32" offset="0x1514" description="Scratch Pad Memory Write Protect Register 5">
        <bitfield id="WP_23_3" description="write protect SPMEM23 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_23_2" description="write protect SPMEM23 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_23_1" description="write protect SPMEM23 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_23_0" description="write protect SPMEM23 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_22_3" description="write protect SPMEM22 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_22_2" description="write protect SPMEM22- DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_22_1" description="write protect SPMEM22 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_22_0" description="write protect SPMEM22 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_21_3" description="write protect SPMEM21 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_21_2" description="write protect SPMEM21 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_21_1" description="write protect SPMEM21 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_21_0" description="write protect SPMEM21 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_20_3" description="write protect SPMEM20 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_20_2" description="write protect SPMEM20 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_20_1" description="write protect SPMEM20 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_20_0" description="write protect SPMEM20 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
    </register>
    <register id="LFSS_SPMWPROT6" width="32" offset="0x1518" description="Scratch Pad Memory Write Protect Register 6">
        <bitfield id="WP_27_3" description="write protect SPMEM27 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_27_2" description="write protect SPMEM27 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_27_1" description="write protect SPMEM27 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_27_0" description="write protect SPMEM27 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_26_3" description="write protect SPMEM26 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_26_2" description="write protect SPMEM26- DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_26_1" description="write protect SPMEM26 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_26_0" description="write protect SPMEM26 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_25_3" description="write protect SPMEM25 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_25_2" description="write protect SPMEM25 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_25_1" description="write protect SPMEM25 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_25_0" description="write protect SPMEM25 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_24_3" description="write protect SPMEM24 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_24_2" description="write protect SPMEM24 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_24_1" description="write protect SPMEM24 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
        <bitfield id="WP_24_0" description="write protect SPMEM24 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="READWRITE" value="0x0" description="SPMEM is read and write access"/>
            <bitenum id="READONLY" value="0x1" description="SPMEM is read only access"/>
        </bitfield>
    </register>
